:PROPERTIES:
:ID: 6F9C3077-8207-48D6-A0C2-883703825B2E
:END:
#+title: View Entity History
#+description: View Entity History
#+type: recipe
#+level: cross
#+filetags: :recipe:sql:temporal_queries:
#+created: 2026-05-21
#+updated: 2026-05-21

See all versions of an entity over time:

#+begin_src sql
select id, username, email, version, valid_from, valid_to,
       case when valid_to = '9999-12-31 23:59:59'::timestamptz
            then 'current' else 'historical' end as status
from ores.accounts
where username = 'admin'
order by valid_from;
#+end_src

#+RESULTS:
#+begin_example
| id | username | email | version | valid_from | valid_to | status |
|----+----------+-------+---------+------------+----------+--------|
#+end_example
